avrdudes/avr-libc/include/avr/ioavr64db32.h
/* Analog Channel Selection Bits bit group values */
typedef enum ADC_MUXPOS_VALUES_enum
{
    ADC_MUXPOS_AIN0_gv             = 0x00,  /* ADC input pin 0 */
    ADC_MUXPOS_AIN1_gv             = 0x01,  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gv             = 0x02,  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gv             = 0x03,  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXPOS_AIN8_gv             = 0x08,  /* ADC input pin 8 */
    ADC_MUXPOS_AIN9_gv             = 0x09,  /* ADC input pin 9 */
    ADC_MUXPOS_AIN10_gv            = 0x0A,  /* ADC input pin 10 */
    ADC_MUXPOS_AIN11_gv            = 0x0B,  /* ADC input pin 11 */
    ADC_MUXPOS_AIN12_gv            = 0x0C,  /* ADC input pin 12 */
    ADC_MUXPOS_AIN13_gv            = 0x0D,  /* ADC input pin 13 */
    ADC_MUXPOS_AIN14_gv            = 0x0E,  /* ADC input pin 14 */
    ADC_MUXPOS_AIN15_gv            = 0x0F,  /* ADC input pin 15 */
    ADC_MUXPOS_AIN16_gv            = 0x10,  /* ADC input pin 16 */
    ADC_MUXPOS_AIN17_gv            = 0x11,  /* ADC input pin 17 */
    ADC_MUXPOS_AIN18_gv            = 0x12,  /* ADC input pin 18 */
    ADC_MUXPOS_AIN19_gv            = 0x13,  /* ADC input pin 19 */
    ADC_MUXPOS_AIN20_gv            = 0x14,  /* ADC input pin 20 */
    ADC_MUXPOS_AIN21_gv            = 0x15,  /* ADC input pin 21 */
    ADC_MUXPOS_GND_gv              = 0x40,  /* Ground */
    ADC_MUXPOS_TEMPSENSE_gv        = 0x42,  /* Temperature sensor */
    ADC_MUXPOS_VDDDIV10_gv         = 0x44,  /* VDD/10 */
    ADC_MUXPOS_VDDIO2DIV10_gv      = 0x45,  /* VDDIO2/10 */
    ADC_MUXPOS_DAC0_gv             = 0x48,  /* DAC0 */
    ADC_MUXPOS_DACREF0_gv          = 0x49,  /* AC0 DAC Voltage Reference */
    ADC_MUXPOS_DACREF1_gv          = 0x4A,  /* AC1 DAC Voltage Reference */
    ADC_MUXPOS_DACREF2_gv          = 0x4B   /* AC2 DAC Voltage Reference */
} ADC_MUXPOS_values_t;

/* Analog Channel Selection Bits bit group configurations*/
typedef enum ADC_MUXPOS_enum
{
    ADC_MUXPOS_AIN0_gc             = (ADC_MUXPOS_AIN0_gv << ADC_MUXPOS_gp),  /* ADC input pin 0 */
    ADC_MUXPOS_AIN1_gc             = (ADC_MUXPOS_AIN1_gv << ADC_MUXPOS_gp),  /* ADC input pin 1 */
    ADC_MUXPOS_AIN2_gc             = (ADC_MUXPOS_AIN2_gv << ADC_MUXPOS_gp),  /* ADC input pin 2 */
    ADC_MUXPOS_AIN3_gc             = (ADC_MUXPOS_AIN3_gv << ADC_MUXPOS_gp),  /* ADC input pin 3 */
    ADC_MUXPOS_AIN4_gc             = (ADC_MUXPOS_AIN4_gv << ADC_MUXPOS_gp),  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gc             = (ADC_MUXPOS_AIN5_gv << ADC_MUXPOS_gp),  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gc             = (ADC_MUXPOS_AIN6_gv << ADC_MUXPOS_gp),  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gc             = (ADC_MUXPOS_AIN7_gv << ADC_MUXPOS_gp),  /* ADC input pin 7 */
    ADC_MUXPOS_AIN8_gc             = (ADC_MUXPOS_AIN8_gv << ADC_MUXPOS_gp),  /* ADC input pin 8 */
    ADC_MUXPOS_AIN9_gc             = (ADC_MUXPOS_AIN9_gv << ADC_MUXPOS_gp),  /* ADC input pin 9 */
    ADC_MUXPOS_AIN10_gc            = (ADC_MUXPOS_AIN10_gv << ADC_MUXPOS_gp),  /* ADC input pin 10 */
    ADC_MUXPOS_AIN11_gc            = (ADC_MUXPOS_AIN11_gv << ADC_MUXPOS_gp),  /* ADC input pin 11 */
    ADC_MUXPOS_AIN12_gc            = (ADC_MUXPOS_AIN12_gv << ADC_MUXPOS_gp),  /* ADC input pin 12 */
    ADC_MUXPOS_AIN13_gc            = (ADC_MUXPOS_AIN13_gv << ADC_MUXPOS_gp),  /* ADC input pin 13 */
    ADC_MUXPOS_AIN14_gc            = (ADC_MUXPOS_AIN14_gv << ADC_MUXPOS_gp),  /* ADC input pin 14 */
    ADC_MUXPOS_AIN15_gc            = (ADC_MUXPOS_AIN15_gv << ADC_MUXPOS_gp),  /* ADC input pin 15 */
    ADC_MUXPOS_AIN16_gc            = (ADC_MUXPOS_AIN16_gv << ADC_MUXPOS_gp),  /* ADC input pin 16 */
    ADC_MUXPOS_AIN17_gc            = (ADC_MUXPOS_AIN17_gv << ADC_MUXPOS_gp),  /* ADC input pin 17 */
    ADC_MUXPOS_AIN18_gc            = (ADC_MUXPOS_AIN18_gv << ADC_MUXPOS_gp),  /* ADC input pin 18 */
    ADC_MUXPOS_AIN19_gc            = (ADC_MUXPOS_AIN19_gv << ADC_MUXPOS_gp),  /* ADC input pin 19 */
    ADC_MUXPOS_AIN20_gc            = (ADC_MUXPOS_AIN20_gv << ADC_MUXPOS_gp),  /* ADC input pin 20 */
    ADC_MUXPOS_AIN21_gc            = (ADC_MUXPOS_AIN21_gv << ADC_MUXPOS_gp),  /* ADC input pin 21 */
    ADC_MUXPOS_GND_gc              = (ADC_MUXPOS_GND_gv << ADC_MUXPOS_gp),  /* Ground */
    ADC_MUXPOS_TEMPSENSE_gc        = (ADC_MUXPOS_TEMPSENSE_gv << ADC_MUXPOS_gp),  /* Temperature sensor */
    ADC_MUXPOS_VDDDIV10_gc         = (ADC_MUXPOS_VDDDIV10_gv << ADC_MUXPOS_gp),  /* VDD/10 */
    ADC_MUXPOS_VDDIO2DIV10_gc      = (ADC_MUXPOS_VDDIO2DIV10_gv << ADC_MUXPOS_gp),  /* VDDIO2/10 */
    ADC_MUXPOS_DAC0_gc             = (ADC_MUXPOS_DAC0_gv << ADC_MUXPOS_gp),  /* DAC0 */
    ADC_MUXPOS_DACREF0_gc          = (ADC_MUXPOS_DACREF0_gv << ADC_MUXPOS_gp),  /* AC0 DAC Voltage Reference */
    ADC_MUXPOS_DACREF1_gc          = (ADC_MUXPOS_DACREF1_gv << ADC_MUXPOS_gp),  /* AC1 DAC Voltage Reference */
    ADC_MUXPOS_DACREF2_gc          = (ADC_MUXPOS_DACREF2_gv << ADC_MUXPOS_gp)   /* AC2 DAC Voltage Reference */
} ADC_MUXPOS_t;

/* Clock Pre-scaler select bit group values */
typedef enum ADC_PRESC_VALUES_enum
{
    ADC_PRESC_DIV2_gv              = 0x00,  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV4_gv              = 0x01,  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV8_gv              = 0x02,  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV12_gv             = 0x03,  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV16_gv             = 0x04,  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV20_gv             = 0x05,  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV24_gv             = 0x06,  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV28_gv             = 0x07,  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV32_gv             = 0x08,  /* CLK_PER divided by 32 */
    ADC_PRESC_DIV48_gv             = 0x09,  /* CLK_PER divided by 48 */
    ADC_PRESC_DIV64_gv             = 0x0A,  /* CLK_PER divided by 64 */
    ADC_PRESC_DIV96_gv             = 0x0B,  /* CLK_PER divided by 96 */
    ADC_PRESC_DIV128_gv            = 0x0C,  /* CLK_PER divided by 128 */
    ADC_PRESC_DIV256_gv            = 0x0D   /* CLK_PER divided by 256 */
} ADC_PRESC_values_t;

/* Clock Pre-scaler select bit group configurations*/
typedef enum ADC_PRESC_enum
{
    ADC_PRESC_DIV2_gc              = (ADC_PRESC_DIV2_gv << ADC_PRESC_gp),  /* CLK_PER divided by 2 */
    ADC_PRESC_DIV4_gc              = (ADC_PRESC_DIV4_gv << ADC_PRESC_gp),  /* CLK_PER divided by 4 */
    ADC_PRESC_DIV8_gc              = (ADC_PRESC_DIV8_gv << ADC_PRESC_gp),  /* CLK_PER divided by 8 */
    ADC_PRESC_DIV12_gc             = (ADC_PRESC_DIV12_gv << ADC_PRESC_gp),  /* CLK_PER divided by 12 */
    ADC_PRESC_DIV16_gc             = (ADC_PRESC_DIV16_gv << ADC_PRESC_gp),  /* CLK_PER divided by 16 */
    ADC_PRESC_DIV20_gc             = (ADC_PRESC_DIV20_gv << ADC_PRESC_gp),  /* CLK_PER divided by 20 */
    ADC_PRESC_DIV24_gc             = (ADC_PRESC_DIV24_gv << ADC_PRESC_gp),  /* CLK_PER divided by 24 */
    ADC_PRESC_DIV28_gc             = (ADC_PRESC_DIV28_gv << ADC_PRESC_gp),  /* CLK_PER divided by 28 */
    ADC_PRESC_DIV32_gc             = (ADC_PRESC_DIV32_gv << ADC_PRESC_gp),  /* CLK_PER divided by 32 */
    ADC_PRESC_DIV48_gc             = (ADC_PRESC_DIV48_gv << ADC_PRESC_gp),  /* CLK_PER divided by 48 */
    ADC_PRESC_DIV64_gc             = (ADC_PRESC_DIV64_gv << ADC_PRESC_gp),  /* CLK_PER divided by 64 */
    ADC_PRESC_DIV96_gc             = (ADC_PRESC_DIV96_gv << ADC_PRESC_gp),  /* CLK_PER divided by 96 */
    ADC_PRESC_DIV128_gc            = (ADC_PRESC_DIV128_gv << ADC_PRESC_gp),  /* CLK_PER divided by 128 */
    ADC_PRESC_DIV256_gc            = (ADC_PRESC_DIV256_gv << ADC_PRESC_gp)   /* CLK_PER divided by 256 */
} ADC_PRESC_t;

/* Resolution selection bit group values */
typedef enum ADC_RESSEL_VALUES_enum
{
    ADC_RESSEL_12BIT_gv            = 0x00,  /* 12-bit mode */
    ADC_RESSEL_10BIT_gv            = 0x01   /* 10-bit mode */
} ADC_RESSEL_values_t;

